Repository: mozilla-l10n/mt-training-data
Catalog: kxp/kxp_pontoon.tmx
Source language: en_us
Languages: kxp

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
kxp: امين اوڳمڻي آفريڪا مان خاص دهيان ٿي انٽرنيٽ نين سئي ڪريا هارو جڳاه ٺاهيا هارو کوجنائي ، سول سوسائيٽي هانَ برادري ني شراڪت ڀيۯان ڪام ڪران ران سان۔ پروگرام نا ڪام هارو وڌيڪ، <programmaticWork></programmaticWork>

source: What is a language on Common Voice?
kxp: عام آواز مان چئي ٻولِي سي؟

source: What issues are you experiencing with this content?
kxp: تمارا تجربا مان ڪوئي مسئلو ڇو هوئي؟

source: What issues are you experiencing with this sentence?
kxp: تمارا تجربا ٿي جُملان مان ڪوئي مسئلو آوي رو سي؟

source: What is your age?
kxp: تماري عمر چيٽلي سي؟

source: What is your sex or gender?
kxp: تماري جنس شون سي؟

source: What kind of goal do you want to build?
kxp: تمين چيوا قسم نُون مقصد تيار ڪروا مانڳو سو؟

source: What makes a good question?
kxp: شون ڪوئي هڌرا سوال ڪري سي؟

source: What needs to be in my file?
kxp: ماري فائيل مان شائي نِي ضرورت سي؟

source: What questions can I add?
kxp: مُون چيوا جملا اپلوڊ ڪريوش

source: What sentences can I add?
kxp: مُون چيوا جملا اپلوڊ ڪريوش

source: What’s inside the Common Voice dataset?
kxp: ڪامن وائيس ڊيٽابيس مان شُون سي؟

source: What's Public?
kxp: عوامي شُون سي؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
kxp: زار ڪوئي منک آواز نا ڪلپ نين رد ڪري سي، تو او قطار مان پاسون آوي سي۔ وري رد ٿائي تو آواز نو ڪلپ سڌو مقام مان زائي سي۔

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
kxp: زار هانمڀۯو، تو ڌيان ٿي زوون سي ڪي شون رڪارڊ ڇُون سي سئي سي زي لکل سي اي سي ڪي نا، ڪوئي مسئلو هشي تو اي ناڪام ٿئي زاشي۔

source: Which variant of { $language } do you speak?
kxp: ٻيزي چئي فرق ٻولي ٻولو سو؟ { $language }

source: Why ?
kxp: چم؟

source: Why a profile?
kxp: ايڪ پروفائيل چم

source: Why are you asking?
kxp: تمين چَم پُوسو را سو

source: Why Common Voice?
kxp: چم عام آواز؟

source: Why does this matter?
kxp: آ مسئلو چم سي؟

source: Why we built this Spontaneous Speech prototype
kxp: امين چم اختياري تقريري نموتو تيار ڪران سان

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
kxp: ايڪ نقشا نان طور برادري مان تمارا زي آواز ليوون هوئي يا راکوون سي

source: Wixarika
kxp: وڪسرِيڪا

source: Wixárika
kxp: وڪسارڪا

source: Wolof
kxp: ولوف

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
kxp: شون تمين پوتان ني آواز نين مقصد ني دراخواست هارو راکو سو۔ يان تمين ڪامن وائس نا ڊيٽا سيٽ هارو ڪرو سو۔

source: Write
kxp: لکو

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
kxp: منک ڪو رُون سي اِي نيسي سئي لکو زي۔ نشان واۯا اکر استعمال ڪرو، اوممم، اررر،

source: Write down what you hear the person saying here
kxp: زي منک ڪي سي اي هانمڀۯين نيسي لکو ڪي شُون ڪيڌون سي۔

source: Write options menu
kxp: فهرست لکو

source: Xhosa
kxp: هوسا

source: Xitsonga
kxp: ايڪٽسون گا

source: y
kxp: يه وائي

source: Y
kxp: يه

source: Yaqui
kxp: ياڪُوئي

source: Yes
kxp: هووي

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
kxp: تمين منين اي ميل ڪريون۔ مون نٿي چاهتو ڪي تمان نين عام آواز نا پروجيڪٽ نا ڀارام همڀۯاوون۔

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
kxp: منين اي ميل ڪرو، مون ٻولي هارو ڪامن وائيس ني ترقي هارو راضي سُون۔

source: Yiddish
kxp: يِدِش

source: Yoruba
kxp: يورُوبا

source: You
kxp: تُون

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
kxp: شروع مان تمين سائز مقدار طريقا نين ڊائونلوڊ ڪرو <size> { $size } GB size>

source: You are prepared to initiate a download of <b>{ $size }</b>
kxp: تمين ڊائون لوڊ شُروع ڪريا هارو تيار سو۔ <b>{ $size }</b>

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
kxp: آ لنڪ مان تماري جُملا جمغ ڪروا سي۔ <writePageLink> لڇا هارو </writePageLink> يان جملا ني دوهرائي هارو <reviewPageLink> صفعو دهرائي ڪرو۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
kxp: تمين پڻ شارٽ ڪٽ ٻٽڻ واۯون بورڊ استعمال ڪرِي ڪو سو { sc-review-form-button-approve-shortcut } منظور ڪريا هارو { sc-review-form-button-reject-shortcut } ڪاڍيا هارو ، { sc-review-form-button-skip-shortcut } ميليا هارُو

source: You can choose to make your username public or anonymous.
kxp: تمين عوام هارو يا ڪوئي پڻ هارو يوزر نام چونڊي ڪو سو۔

source: You can find <examplePromptsLink>120 example prompts in this sheet.</examplePromptsLink>
kxp: تمين آنڻي شيٽ مان مثال ڳوتي ڪو سو <examplePromptsLink></examplePromptsLink>

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
kxp: ڊيٽا بيس نا صفعا نين زوئو۔ <datasetsPage> ٻولي هانَ عمل نين زوئو زي تمين چاهو سو۔ تمين ڊائون لوڊ ڪري ڪو سو۔ </metadataLink> اي ئلم شماريت ني معلومات سي هانَ قيٽا تصديق هارو سي۔ ڊيٽا بيس نين ڊائون لود ڪريا هاو اي ميل آلو۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
kxp: تمين ايڪ ڪامن وائيس پروفائيل تيار ڪرينَ ايڪ خاص اوپن سورس ڊيٽا ٺاهيا مان مدد ڪري ڪو سو۔

source: You can meet others in the Mozilla language communities by joining <discordLink>Discord</discordLink> or <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
kxp: تمين موزيلا ٻولو هارو ٻيزان برادري نان منکان ٿي مِلو اين هارو آ لنڪ سي، <discordLink>ڊسڪورڊ</discordLink> or <discourseLink>ڊسڪورس </discourseLink> هارو خاص وات يان <matrixLink>ميٽرڪ</matrixLink>مشورا هارو .

source: You cannot add multiple sentences for a single submission
kxp: ايڪ زڻو پيش ڪريا واۯو وڌاري جملا وا ڳڏاوي

source: You cannot request your recordings while another request is already in progress.
kxp: تمين تماري رڪارڊنگ ني درخواست نٿي ڪري ڪيتا، چم تو اڳي ايڪ درخواست جاري سي۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
kxp: تمين ايڪ پروگرام راکو زي منکان هارو مدد ٿئي ڪي۔ تمين سوچو ڪي چچم آسان سي۔ تمين آن لائين ويڊيو ڪانفرنس ڪرو۔ يان ڪوئي منک ٿي زي هورون هوئي۔ <eventTemplate> ٽيمپليٽ نين چيڪ ڪرو هانَ ڪانڪ وڌيڪ شيزون پروگرام هارو واپراوو۔

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
kxp: تمين آ جُملا نين ڪانڪ وقت هارو <sentenceCollectorLinkAdd>تمين هاڇي تبديل ڪري ڪو سو۔ </sentenceCollectorLinkAdd>، يان تمين <bulkImportDocsLink>GitHub يان هيئي راڇا هارو جُملا يان عوامي ملڪيت لازمي سي</bulkImportDocsLink> يان تمين پوتي جُملا لڇي ڪو سيو۔ شُون تمان نين ترجما مان ڪوئي لحجا ني ضروروت سي؟

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
kxp: آ لنڪ استعمال ڪرو <scraperLink> جملا ليڌا واۯو ڪانڪ وڪيپيڊيا مان جملا سي۔

source: You check whether the transcription matches the audio
kxp: تمي چيڪ ڪرو زار نقل ملتي جُلتي هوئي

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
kxp: تمين ڪامن وائيس ني ويب سائيٽ شامل ڪرِي ڪو سو۔ https://commonvoice.mozilla.org/

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
kxp: تمين تعليمي حوالاجات نو استعمال ڪري ڪو سو۔ زم هارڊ ورڊ نمونو ڪامن وائيس آنئين موجود سي https://commonvoice.mozilla.org/ 15th September 2021)" دستياب سي۔

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
kxp: تمين ڪوئي ڪوئي ڪام هارو سوشل ميڊيا نو استعمال ڪرو۔ هانَ پوسٽ شير ڪرو هانَ بيان ڪرو ڪي ڪوئي مسئلو سي۔ هانَ وڌيڪ مسئلا نا ڀارا مان منکان ٿي وات ڪرو زم ٻولي نو مسئلو سي۔ آواز يا، طرف داري آرٽ وڌيڪ مشورا هارو زوئو <campaignLink> سوشل مهم ايئان ني فهرست زوئو۔ </campaignLink>.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
kxp: تمين ڪوئي ٻولِي نِي چُونڊ نٿِي ڪرِي، مهرباني ڪرينَ پروفائيل مان زائين ٻولِي چُونڊو

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
kxp: 2، مثال۔ ٻيزا جملا ني حد هارو وري ڪوشش ڪرو۔ تمارا صبر هارو مهرباني

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
kxp: 2، مثال۔ ٻيزي وات ڪي وڌاري جملا ني حد هوڌي پوتيا هارو تمين صبر ڪرو مهرباني

source: You might also want to consider spanning different contexts and domains.
kxp: تمان نين مختلف سياق و سباق ڊومنيز نين وڌايا هارو غور ڪروو زويئي۔

source: You must allow microphone access.
kxp: ڪانَ واۯُون مائيڪ ضرور استعمال ڪرو

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
kxp: امين نين ضرورت سي ڪي هر ايڪ رڪارڊ ٿل اکر هانڀۯوا سي۔ امين چاهان سان مشين الگوٿيم زي ٻارلو آواز سي اين نين قاٻو ڪري۔ ايٽلا هوڌي ڪي الاهي وڌاري آواز يان ٻاري ٿي خاموش واۯو آواز آوي سي اين قبول ڪري ڪي تمان نين مڪمل متن هانڀۯيا مان آوي۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
kxp: تمارو لهجو اُو سي زين مان تمين لفظ نو اُچار ڪاڍو سو۔ تمين چانئين رو سو، تمين ٻيزي چئي ٻولي ٻولو سو۔ هانَ ٻيزا الاهي ايوا عمل سي زين ني تمين تصوير آلي ڪو سو۔ تمان ڪنين زي معلومات سي اي پيش ڪري ڪو سو۔

source: Your daily goal has been created
kxp: تمارو هروز نو مقصد تيار ٿئي جھو سي

source: Your dataset is downloading!
kxp: تمارو ڊيٽابيس ڊائونلوڊ ٿائي رو سي

source: Your download has started.
kxp: تمارون ڊائون لوڊ شروع سي

source: You’re contributing to a target segment
kxp: تمين اَمارا پيهريا ٽارگيٽ سيڪشن مان حصو لو را سو۔

source: You’re contributing to our first target segment
kxp: تمين امارا پيهريا ٽارگيٽ سيڪشن مان حصو لو را سو۔

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
kxp: في الحال همڻين تمين بولڍ هارو تيار سو، بولڍ نا بولڍ تمارا مقصد هارو اي ميل هيئي سڙاوي سي۔ مارا ترقي هارو اپڍيٽ هانَ عام آواز هارو خيير

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
kxp: في الحال تمين بولڍ هارو تيار سو، بولڍ نا بولڍ تمارا مقصد هارو اي ميل هيئي سڙاوي سي۔ مارا ترقي هارو اپڍيٽ هانَ عام آواز هارو خيير

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
kxp: تمين الاهي تيز زو را سو، مهرباني ڪرينَ جائزا هارو ڪانڪ وکت لو، فهرست يان رپورٽ نا مسئلا هارُو تمان نين ڀروسو هوئي ڪي اِي درست سي۔

source: You're helping Common Voice reach our daily sentence goals!
kxp: امارا مقصد هوڌي پوتيا هارو تمين عام آواز مان مدد ڪرو را سو۔

source: Your email address
kxp: تماري ايل ميل ايڊريس

source: You respond or reply to it as naturally as you can
kxp: تماري جوابداري يان ورندي زي قدرتي طور آلي ڪو سو

source: Your Languages
kxp: تمارِي ٻولِي

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
kxp: تماري ٻولي نو قسم ڪلپ ٿي ٻاري ٿئي ڪي سي، آرام ٿِي ٻولِي نان جملان نِي سيٽگ سهي ڪرو،

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
kxp: تمارِي ٻولِي نا قسم جُملان ٿي ٻاري ٿئي ڪي سي۔ زي تمين ٺيڪ سو تو تمارِي ٻولِي نا جملان نِي سيٽنگ سهي ڪرِي ڪو سو۔

source: Your username and email will not be associated with the published data.
kxp: تمارون يوزر نام هانَ اي ميل عوامي مان نين ڳڏايون زائي۔

source: Your weekly goal has been created
kxp: تمارو هفتيوار مقصد تيار ٿئي جھو سي

source: You should receive an email from our Community Manager explaining the steps to get your language added to Common Voice
kxp: تمان نين اماري برادري نا مينيجر نا طرف ٿي اي ميل آيون سي۔ زي تماري ٻولي نين ڪامن وائيس مان شامل ڪريا ني وضاحت ڪري زاشي۔

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
kxp: تمين عام رڪارڊنگ مان مدد ڪرِي سي { $goalValue } <goalPercentage> رڪاڊنگ نا مقصد هوڌي پوتيا مان مدد ڪرِي سي۔</goalPercentage>

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
kxp: تمين عام آواز هروزنِي { $goalValue } تصديق نا مدد <goalPercentage></goalPercentage> هُوڌي پوٽيا مان مدد ڪرِي سي۔

source: You've successfully signed up for contributing to { $language }. Thank you.
kxp: تمين ڪاميابي ٿي ڪامن وائيس هارو سائن اپ ڪريون پرون سي { $language } مهرباني

source: You want to join the Common Voice mailing list
kxp: تمين ڪامن وائيس ني ميل لسٽ مان شامل ٿاوا چاهو سو؟

source: You write down what you hear in the audio clips
kxp: آڊيو ڪلپ مان زي هانڀۯيون سي اي نيسي لکو

source: Zaza
kxp: زازا

source: Zulu
kxp: زُولُو
